export const TASKS = [
  {
    name: "Задача коммивояжера",
    desc: "Задача поиска гамильтонова цикла на взвешенном графе с минимальной суммой ребер.",
    img: "assets/1.jpg",
  },
  {
    name: "Задача о независимом подмножестве",
    desc: "Задача поиска максимального набора вершин в графе, таком, что никакие две вершины входящие в него не соеденены ребром.",
    img: "assets/2.jpg",
  },
  {
    name: "Задача о сумме подмножеств",
    desc: "Дан список действительных чисел. Необходимо определить, существует ли набор чисел из этого списка, такой, что его сумма равна нулю.",
    img: "assets/3.jpg",
  },
  {
    name: "Задача о минимальном доминирующем множестве",
    desc: "В теории графов доминирующее множество для графа G = (V, E) — это подмножество D множества вершин V, такое, что любая вершина не из D смежна хотя бы одному элементу из D. Число доминирования γ(G) — это число вершин в наименьшем доминирующем множестве G. Задача заключается в определении числа доминирования графа.",
    img: "assets/4.jpg",
  },
  {
    name: "Задача о назначениях на гиперграфе",
    desc: "Задача поиска минимальной суммы непересекающихся дуг во взвешенном двудольном гиперграфе.",
    img: "assets/5.jpg",
  },
  {
    name: "Задача раскраски графа",
    desc: "Хроматиическое число графа — минимальное число цветов, в которые можно раскрасить вершины графа так, чтобы концы любого ребра имели разные цвета. Задача заключается в поиске хроматического числа графа.",
    img: "assets/6.jpg",
  },
  {
    name: "Задача о рюкзаке",
    desc: "Пусть имеется набор предметов, каждый из которых имеет два параметра — масса и ценность. Также имеется рюкзак определённой грузоподъёмности. Задача заключается в том, чтобы собрать рюкзак с максимальной ценностью предметов внутри, соблюдая при этом ограничение рюкзака на суммарную массу.",
    img: "assets/7.jpg",
  },
  {
    name: "Задача о максимальной клике на взвешенном графе",
    desc: "Задача поиска максимальной клики в взвешенном графе.",
    img: "assets/8.jpg",
  },
];
